RECIPE_NAME_LENGTH = 256
"""Максимальная длина названия рецепта."""

LENGTH_TO_DISPLAY = 25
"""Длина для отображения текста в админке."""

LENGTH_TAG = 32
"""Максимальная длина тега и его слага."""

LENGTH_INGREDIENT = 128
"""Максимальная длина названия ингредиента."""

LENGTH_MESURE_UNIT = 64
"""Максимальная длина единицы измерения."""

SHORT_LINK_LENGTH = 7
"""Длина для короткой ссылки на руцепт."""

COOKING_TIME = 1
"""Время готовки не меньше 1 минуты."""

MIN_AMOUNT = 1
"""Минимальное количество для ингредиента."""
